Revit 2027 API
View.GetModelToProjectionTransforms Method
 Gets the transforms from the model space to the view projection space.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<TransformWithBoundary> GetModelToProjectionTransforms()
Public Function GetModelToProjectionTransforms As IList(Of TransformWithBoundary)
public:
IList<TransformWithBoundary^>^ GetModelToProjectionTransforms()
member GetModelToProjectionTransforms : unit -> IList<TransformWithBoundary>
Return Value
IList<TransformWithBoundary>
 The transformations from the model space to view projection space.
Exceptions
Exception | Condition
InvalidOperationException |  The view does not return transforms. -or- The view is a perspective view.
Remarks
 Model space is the global 3D coordinate space in which the geometry of the model lives.
 View projection space is the 3D Euclidean space with a coordinate system such that X and Y are horizontal and vertical directions in the view projection plane and Z is the cross product of X and Y. Distances in the projection space are the same as would be measured on paper if the view is printed without additional scaling.
 Most views will return just one TransformWithBoundary. The exceptions are views with split crop regions. Split crop regions can be independently moved and therefore each region of a split crop gets its own transform and boundary. You can check if a view has split crop regions by getting the ViewCropRegionShapeManager and calling [!:ViewCropRegionShapeManager.IsSplit()].
 When the view's crop region is split, many TransformWithBoundary objects will be returned. Each TransformWithBoundary corresponds to one region of the split crop. To determine which TransformWithBoundary to use when converting a model point into view projection space, first test to see which split crop region boundary contains the model point. See [!:TransformWithBoundary.GetBoundary()].
See Also
Reference
View Class
Autodesk.Revit.DB Namespace